app/controllers/book_lists_controller.rb

  def index
    @book_lists = BookList.all
---
SELECT "book_lists".* FROM "book_lists"

  def create
    @book_list = BookList.new(book_list_params)

    respond_to do |format|
      if @book_list.save
---
INSERT INTO "book_lists" ("name", "despriction", "year", "author", "number_of_pages", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_book_list
      @book_list = BookList.find(params[:id])
---
SELECT  "book_lists".* FROM "book_lists" WHERE "book_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]